{
  "author": "André Kless <andre.kless@web.de.de> 2017",
  "license": "The MIT License (MIT)",

  "le01": {
    "innerHTML": "<script src=../js/ccm.quiz.js></script><h1>Lerneinheit: Was ist HTML?</h1><h2>1. Motivation, Lernziele und Voraussetzungen</h2><p>Das Internet hat vieles verändert. Wie selbstverständlich surfen immer mehr Menschen im Internet und nutzen es längst nicht mehr nur um sich Wissen anzueignen, sondern beispielsweise auch um zu shoppen, zu spielen, Filme zu schauen, sich mit anderen zu vernetzen und alle möglichen Dienstleistungen in Anspruch zu nehmen. Um im Internet vertreten zu sein bedarf es einer Webseite, die Internetnutzer über ihren Webbrowser aufrufen können. Aber wie entsteht eigentlich so eine Webseite? Kann man das auch selber machen? Ja natürlich, das geht! Das erste was man dafür kennen muss ist die Muttersprache des Internets: HTML. In dieser Lerneinheit erfahren Sie was HTML ist, wofür es steht und eingesetzt wird und von wem es zu welchem ursprünglichen Zweck überhaupt erfunden wurde. Anschließend erfahren Sie, wer an der Weiterentwicklung von HTML arbeitet und in welcher Version HTML aktuell vorliegt. Was sollten Sie an Wissen mitbringen? Nun, um zu verstehen worum es hier geht, sollten Sie zumindest schon wissen was das Internet, ein Webbrowser und was eine Webseite ist. Kurz gesagt: Sie sollten bereits Erfahrungen mit der Nutzung des Internets, sprich mit dem Besuchen von Webseiten im Internet, haben.</p><audio src=../audio/LE01_Motivation.mp3></audio><h3>1.1 Lernziele</h3><ul><li>Ich weiß, was HTML ist, wofür es steht und wofür es eingesetzt wird.<li>Ich weiß, wer HTML zu welchem ursprünglichen Zweck erfunden hat.<li>Ich weiß, wer an der Weiterentwicklung von HTML arbeitet.<li>Ich weiß, in welcher Version HTML aktuell vorliegt.</ul><h3>1.2 Voraussetzungen</h3><ul><li>Ich weiß, was das Internet, was ein Webbrowser und was eine Webseite ist.<li>Ich habe bereits diverse Webseiten im Internet aufgerufen.</ul><p>Falls Sie bisher nur wenige Erfahrungen mit dem Internet haben, hier das wichtigste:<h4>1.2.1 Kurz und knapp: Internet, Webbrowser und Webseiten</h4><p>Das Internet ist das größte Netzwerk der Welt, das internetfähige Geräte miteinander vernetzt, wodurch diese dann in der Lage sind, Informationen bzw. Daten auszutauschen. Wir Menschen nutzen das Internet üblicherweise über einen Webbrowser, bei dem es sich um ein Computerprogramm handelt, über das wir im Internet veröffentlichte Webseiten aufrufen können. Wenn man also selbst eine Webseite veröffentlicht, können die darauf präsentierten Inhalte von jedem Menschen in der Welt, der über ein internetfähiges Gerät verfügt, mit Hilfe eines Webbrowsers abgerufen werden.</p><ccm-le-audio src=../audio/LE01_Grundlage.mp3></ccm-le-audio><h2>2. Inhalt: Was ist HTML?</h2><ccm-le-video src=../video/LE01_Inhalt.mp4></ccm-le-video><h3>2.1 Hypertext Markup Language</h3><p>HTML steht für <a href=https://de.wikipedia.org/wiki/Hypertext_Markup_Language>Hypertext Markup Language</a>. Das ist Englisch und die Übersetzung ins Deutsche verrät uns, dass es sich um eine Hypertext-Auszeichnungssprache handelt. Doch was bedeutet das? Nun, <a href=https://de.wikipedia.org/wiki/Auszeichnungssprache>Auszeichnungssprache</a> bedeutet, dass es sich hier um eine Sprache handelt, die von einer Maschine gelesen werden kann und zur Gliederung und Formatierung von Texten und anderen Daten dient. <a href=https://de.wikipedia.org/wiki/Hypertext>Hypertext</a> bedeutet, dass diese Texte auch Querverweise, sogenannte <a href=https://de.wikipedia.org/wiki/Hyperlink>Hyperlinks</a>, enthalten können, durch die man direkt zu anderen Textstellen im selben oder in anderen Hypertexten springen kann.</p><ccm-le-img src=../image/LE01_Inhalt.001.jpeg></ccm-le-img><h3>2.2 Einsatzgebiet</h3><p>In der Praxis wird HTML zur Strukturierung digitaler Dokumente eingesetzt, die Texte mit Hyperlinks, Bildern und viele andere digitale Elemente enthalten können. Ein in HTML erstelltes digitales Dokument kann von einem <a href=https://de.wikipedia.org/wiki/Webbrowser>Webbrowser</a> gelesen werden, der uns dann deren Inhalte, so wie wir es im <a href=https://de.wikipedia.org/wiki/Internet>Internet</a> kennen, schließlich als Webseite darstellt.</p><ccm-le-img src=../image/LE01_Inhalt.002.jpeg></ccm-le-img><h3>2.3 Erfinder</h3><p>Wer hat sich dieses HTML überhaupt ausgedacht? Nun, als Erfinder von HTML gilt der britische Physiker und Informatiker <a href=https://de.wikipedia.org/wiki/Tim_Berners-Lee>Tim Berners-Lee</a>, der zu dieser Zeit im Jahr 1989 für die <a href=https://de.wikipedia.org/wiki/CERN>Europäische Organisation für Kernforschung (CERN)</a> in Genf arbeitete. Sein ursprüngliches Ziel war es, wissenschaftliche Publikationen mit Kollegen anderer Standorte austauschen zu können. Darüber hinaus legte er damit einen wichtigen Grundstein für das Internet, so wie wir es heute kennen und nutzen.</p><ccm-le-img src=../image/LE01_Inhalt.003.jpeg></ccm-le-img><h3>2.4 Web und W3C</h3><p>Durch das <a href=https://de.wikipedia.org/wiki/World_Wide_Web>World Wide Web (WWW, oder kurz Web)</a> können wir mit einem Webbrowser, der mit dem Internet verbunden ist, jede im Internet zugängliche Webseite laden und uns deren Inhalte anschauen. Für die Weiterentwicklung des Webs und deren Standards gründete Tim Berners-Lee im Jahr 1994 das <a href=https://de.wikipedia.org/wiki/World_Wide_Web_Consortium>World Wide Web Consortium (W3C)</a>. Dieses Gremium ist auch heute noch für die Entwicklung technischer Spezifikationen und Richtlinien für das Web verantwortlich und somit auch für die Weiterentwicklung und Standardisierung von HTML. Eine Standardisierung ist vor allem deshalb von zentraler Bedeutung, damit die verschiedenen Webbrowser ein in HTML geschriebenes digitales Dokument nicht unterschiedlich interpretieren. Ohne Standardisierung müssten wir unser HTML sonst, je nachdem welcher Webbrowser zur späteren Darstellung verwendet wird, unterschiedlich schreiben.</p><ccm-le-img src=../image/LE01_Inhalt.004.jpeg></ccm-le-img><h3>2.5 Weiterentwicklung</h3><p>Da die Weiterentwicklung von Web-Standards beim W3C nur sehr langsam voran geht, wurde im Jahre 2004 die Arbeitsgruppe <a href=https://de.wikipedia.org/wiki/Web_Hypertext_Application_Technology_Working_Group>Web Hypertext Application Technology Working Group (WHATWG)</a> gegründet, die ebenfalls unter anderem an der Weiterentwicklung von HTML arbeitet und der auch die führenden Hersteller von Webbrowsern mit angehören. Die WHATWG setzt das W3C allerdings nicht ausser Kraft, sondern erarbeitet viel mehr Vorschläge für neue Web-Standards, die dann beim W3C eingereicht werden. Die aktuellste Version von HTML, die von der WHATWG ausgearbeitet und dem W3C vorgelegt wurde, ist <a href=https://de.wikipedia.org/wiki/HTML5>HTML5</a>. HTML5 bringt viele neue Elemente und Funktionen mit sich, die das Erstellen von Webseiten erheblich erleichtern und von allen gängigen Webbrowsern bereits weitgehend unterstützt werden.</p><ccm-le-img src=../image/LE01_Inhalt.005.jpeg></ccm-le-img><h2>3. Selbsttest</h2><ccm-quiz key='[\"ccm.get\",\"../data/quiz.json\",\"le01\"]'></ccm-quiz><h2>4. Alternative Materialien</h2><h3>4.1 Hypertext Markup Language | Wikipedia</h3><p>Wikipedia-Artikel zu HTML.</p><ccm-le-link href=https://de.wikipedia.org/wiki/Hypertext_Markup_Language></ccm-le-link><h3>4.2 Das World Wide Web Wunder | YouTube</h3><p>Eine Dokumentation über die Anfänge des Internets.</p><ccm-le-link href=https://youtu.be/0XQOLzkuqvw></ccm-le-link><h3>4.3 HTML | MDN</h3><p>Einführung in HTML aus dem Hause <a href=https://de.wikipedia.org/wiki/Mozilla_Foundation>Mozilla</a>, den Machern des Webbrowsers <a href=https://de.wikipedia.org/wiki/Mozilla_Firefox>Firefox</a>.</p><ccm-le-link href=https://developer.mozilla.org/de/docs/Web/HTML></ccm-le-link><h2>5. Weiterführende Materialien</h2><h3>5.1 Tim Berners-Lee: \"Vage, aber hochinteressant\" | WELT</h3><p>WELT-Artikel mit einem ausführlichen Interview mit Tim Berners-Lee aus dem Jahr 2017.</p><ccm-le-link href=http://hd.welt.de/eilmeldung_welthd/eilmeldung/article164318750/Vage-aber-hochinteressant.html></ccm-le-link>"
  },
  "le02": {
    "innerHTML": "<script src=../js/ccm.quiz.js></script><h1>Lerneinheit:<br>Erste “Hallo Welt!”-Webseite</h1><h2>1. Motivation, Lernziele und Voraussetzungen</h2><p>Wer sich eine eigene Webseite zulegen möchte und danach googelt landet im Internet schnell bei einem von vielen Dienstleistern, die genau das mit wenigen Klicks anbieten. Meist verbirgt sich dahinter dann eine Art Fertigbaukasten, mit dem man ohne HTML-Kenntnisse sich aus diversen Vorlagen und Layouts seine Webseite schnell und einfach zusammenklicken kann und anschließend nur noch die eigenen Inhalte wie Texte und Bilder an den passenden Stellen zu ergänzen braucht. Sind diese Vorlagen für die eigenen Zwecke allerdings nicht ausreichend individuell anpassbar, beginnt die Suche nach Alternativen. Wer es sich leisten kann, könnte sich nun überlegen einen Webdesigner zu beauftragen. Wäre es aber nicht vielleicht auch möglich, es selbst zu tun? Doch wie fängt man da an? Nun, falls Sie bereits damit vertraut sind was HTML ist und wofür es eingesetzt wird, wissen Sie bereits, dass es sich bei einer Webseite um ein in HTML geschriebenes digitales Dokument handelt, das von einem Webbrowser gelesen und schließlich als Webseite dargestellt wird. Der erste Schritt ist also das Anlegen eines solchen digitalen Dokuments. In dieser Lerneinheit erfahren Sie, wie man ein HTML-basiertes digitales Dokument erstellen, editieren und mit einem Webbrowser ausführen kann. Hierzu sollten Sie bereits über einen Computer verfügen, auf dem Sie eine Datei erstellen können und auf dem bereits ein Webbrowser installiert ist. Sie sollten wissen wie man eine Datei erstellt, umbenennt, die Dateiendung festlegt und wie man eine Datei mit einem bestimmten Programm öffnen kann.</p><ccm-le-audio src=../audio/LE02_Motivation.mp3></ccm-le-audio><h3>1.1 Lernziele</h3><ul><li>Ich bin in der Lage eine neue Webseite mit dem Inhalt \"Hallo Welt!\" über ein HTML-basiertes digitales Dokument zu erstellen.<li>Ich weiß, mit welchem Programm der Inhalt eines HTML-basierten digitalen Dokuments als Webseite dargestellt werden kann.</ul><h3>1.2 Voraussetzungen</h3><ul><li>Ich weiß, was HTML ist und wofür es eingesetzt wird.<li>Ich habe einen Computer auf dem man eine Datei erstellen kann und auf dem bereits ein Webbrowser installiert ist.<li>Ich weiß, wie man eine Datei erstellt, umbenennt, die Dateiendung festlegt und wie man sie mit einem bestimmten Programm öffnen kann.</ul><p>Falls Sie nur wenige Erfahrungen im Umgang mit Dateien und Programmen haben, lassen Sie sich von jemanden aus Ihrem Bekanntenkreis helfen oder besuchen Sie einen entsprechenden Computer-Einsteigerkurs, um die nötigen Kenntnisse zu erwerben.<h2>2. Inhalt: Erste “Hallo Welt!”-Webseite</h2><ccm-le-video src=../video/LE02_Inhalt.mp4></ccm-le-video><h3>2.1 Erstellung einer HTML-Datei</h3><p>Zum Erstellen einer Webseite wird ein HTML-basiertes digitales Dokument benötigt. Dabei handelt es sich üblicherweise um nichts anderes als eine sogenannte HTML-Datei, also eine Datei mit der Dateiendung \".html\", die wir nun erstellen. Hierzu legen wir eine neue Datei an, geben ihr einen Namen und legen als Dateiendung \".html\" fest. Bitte beachten, dass die Vorgehensweise zur Erstellung einer Datei sich je nach Betriebssystem unterscheidet.</p><ccm-le-img src=../image/LE02_Inhalt.001.jpg></ccm-le-img><h3>2.2 Programme zur Bearbeitung einer HTML-Datei</h3><p>Um den Inhalt der erstellten HTML-Datei bearbeiten zu können, müssen wir sie mit einem dafür geeigneten Programm öffnen. Zur Bearbeitung einer HTML-Datei bieten sich eine Vielzahl unterschiedlichster Programme an: Vom einfachen <a href=https://de.wikipedia.org/wiki/Texteditor>Texteditor</a> über webbasierte Online-Editoren bis hin zu den professionellen <a href=https://de.wikipedia.org/wiki/Integrierte_Entwicklungsumgebung>integrierten Entwicklungsumgebungen</a>. Falls Sie noch unentschieden sind, welches konkrete Programm Sie verwenden möchten, recherchieren Sie dies im Internet. In diesem Video wird von mir der kostenfreie Texteditor \"<a href=https://www.sublimetext.com/2>Sublime Text 2</a>\" eingesetzt, der auch für alle gängigen Betriebssysteme angeboten wird. Im Internet finden sich aber wie gesagt auch viele weitere Alternativen.<h3>2.3 Editieren einer HTML-Datei</h3><p>Sobald fest steht, welches konkrete Programm verwendet wird und dieses auch installiert ist, können wir die erstellte HTML-Datei nun mit diesem Programm zum Bearbeiten öffnen. Es erscheint ein leeres Editorfenster, über das wir den Inhalt der Datei festlegen können. Hier können wir zum einen die Inhalte unserer Webseite festlegen und zum anderen damit beginnen mittels HTML das digitale Dokument und damit die Webseite und deren Inhalte zu strukturieren.</p><ccm-le-img src=../image/LE02_Inhalt.003.jpg></ccm-le-img><h3>2.4 Dokumenttypdefinition</h3><p>Damit der Webbrowser später beim Öffnen unserer HTML-Datei überhaupt weiß, in welcher Sprache der Inhalt der Datei zu interpretieren ist, erfolgt in der ersten Zeile zunächst die sogenannte <a href=https://de.wikipedia.org/wiki/Dokumenttypdefinition>Dokumenttypdefinition</a> oder kurz DOCTYPE-Angabe genannt. Da wir vor haben unser digitales Dokument in HTML5 zu schreiben, geben wir dies nun in der ersten Zeile der HTML-Datei wie folgt an:</p><code><pre>&lt;!doctype html></pre></code><p>In den darauffolgenden Zeilen können wir nun den Inhalt für unsere Webseite festlegen. Für den Einstieg geben wir zunächst als Inhalt einfach nur \"Hallo Welt!\" an. Der Inhalt unserer HTML-Datei sieht damit also wie folgt aus:</p><ccm-le-img src=../image/LE02_Inhalt.004.jpg></ccm-le-img><h3>2.5 Öffnen der HTML-Datei im Webbrowser</h3><p>Damit wir sehen können, ob die Webseite nun den von uns festgelegten Inhalt enthält, wird es Zeit für den ersten Aufruf unserer Webseite. Zunächst gilt es aber noch die Änderungen an der Datei zu speichern. Danach öffnen wir die HTML-Datei, diesmal mit dem Webbrowser. In diesem Video verwende ich den Webbrowser <a href=https://de.wikipedia.org/wiki/Google_Chrome>Google Chrome</a>, es kann aber auch jeder andere moderne Webbrowser wie <a href=https://de.wikipedia.org/wiki/Mozilla_Firefox>Firefox</a>, <a href=https://de.wikipedia.org/wiki/Internet_Explorer>Internet Explorer</a>, <a href=https://de.wikipedia.org/wiki/Apple_Safari>Safari</a> oder <a href=https://de.wikipedia.org/wiki/Opera_(Browser)>Opera</a> verwendet werden. Daraufhin sollte nun eine leere Webseite erscheinen, die nur ganz oben links den von uns festgelegten Inhalt \"Hallo Welt!\" enthält.</p><ccm-le-img src=../image/LE02_Inhalt.005.jpg></ccm-le-img><h2>3. Selbsttest</h2><ccm-quiz key='[\"ccm.get\",\"../data/quiz.json\",\"le02\"]'></ccm-quiz><h2>4. Alternative Materialien</h2><h3>4.1 Die 9 besten kostenlosen HTML-Editoren für Webentwickler (Windows-Edition) | Dr. Web</h3><p>Online-Artikel der einige kostenlose Programme auflistet, die zum Bearbeiten einer HTML-Datei genutzt werden können. Der Artikel führt hauptsächlich Programme für Windows auf. Für Mac-Nutzer gibt es <a href=https://www.drweb.de/magazin/die-5-besten-kostenlosen-html-editoren-fuer-webentwickler-mac-edition-53159/ >hier</a> aber auch einen Artikel.</p><ccm-le-link href=https://www.drweb.de/magazin/die-8-besten-kostenlosen-html-editoren-fuer-webentwickler-windows-edition-53187/ ></ccm-le-link><h3>4.2 Thimble von Mozilla – Ein Online-Quelltext-Editor für Lernende & Ausbilder. | Mozilla</h3><p>Sehr empfehlenswerter kostenloser Online-Quelltext-Editor zur Erstellung von Webseiten aus dem Hause <a href=https://de.wikipedia.org/wiki/Mozilla_Foundation>Mozilla</a>, aus dem auch der Webbrowser <a href=https://de.wikipedia.org/wiki/Mozilla_Firefox>Firefox</a> stammt. Ein Online-Editor hat den Vorteil, dass keinerlei Installation notwendig ist und kein bestimmtes Betriebssystem vorausgesetzt wird.</p><ccm-le-link href=https://thimble.mozilla.org/de/ ></ccm-le-link><h3>4.3 WebStorm: The Smartest JavaScript IDE | JetBrains</h3><p>WebStorm ist die professionelle (nicht kostenlose) integrierte Entwicklungsumgebung, die ich auch selbst beruflich für die Webentwicklung primär einsetze und die insbesondere auch HTML5 unterstützt.</p><ccm-le-link href=https://www.jetbrains.com/webstorm/ ></ccm-le-link>"
  },
  "le03": {
    "innerHTML": "<script src=../js/ccm.quiz.js></script><script src=../js/ccm.cloze.js></script><h1>Lerneinheit: HTML-Tags</h1><h2>1. Motivation, Lernziele und Voraussetzungen</h2><p>Nach dem Erstellen einer neuen HTML-Datei und der Dokumenttypdefinition in deren erster Zeile, können wir in den darauffolgenden Zeilen bereits die ersten Inhalte für die Webseite angeben und uns diese dann in einem Webbrowser auch darstellen lassen. Wenn Sie diese Schritte bereits beherrschen, können wir als nächstes die Frage stellen, wie die Inhalte der Webseite nun mit Hilfe von HTML auch strukturiert werden können und wie neben einfachem Text auch andere Inhalte, wie z.B. Hyperlinks, Bilder, Audio, Video, Listen, Tabellen, Formulare und Buttons mittels HTML in die Webseite integrierbar sind. Voraussetzung dafür ist es, sich mit den Befehlen in HTML, den sogenannten HTML-Tags, auszukennen. In dieser Lerneinheit lernen Sie daher, was ein HTML-Tag ist, woraus er besteht, wofür man ihn nutzt und wie man ihn einsetzt. Dabei werden Sie bereits die konkreten HTML-Tags zur Markierung von Überschriften, Paragraphen und Zeilenumbrüchen kennenlernen und auch wie man Kommentare in HTML schreibt.</p><ccm-le-audio src=../audio/LE03_Motivation.mp3></ccm-le-audio><h3>1.1 Lernziele</h3><ul><li>Ich weiß, was ein HTML-Tag ist, wofür man ihn nutzt, woraus er besteht und wie man ihn einsetzt.<li>Ich kenne die konkreten HTML-Tags zum Markieren von Überschriften, Paragraphen und Zeilenumbrüchen und bin in der Lage diese einzusetzen.<li>Ich weiß wie man einen Kommentar in HTML schreibt, wofür man ihn einsetzt und bin in der Lage Kommentare in HTML einzusetzen.</ul><h3>1.2 Voraussetzungen</h3><ul><li>Ich bin in der Lage eine neue Webseite mit dem Inhalt \"Hallo Welt!\" über ein HTML-basiertes digitales Dokument zu erstellen und mir den Inhalt der Webseite über einen Webbrowser anzeigen zu lassen.</ul><h2>2. Inhalt: HTML-Tags</h2><ccm-le-video src=../video/LE03_Inhalt.mp4></ccm-le-video><h3>2.1 Was ist ein HTML-Tag?</h3><p>In der Auszeichnungssprache HTML sind die HTML-Tags die Auszeichnungselemente. Innerhalb einer HTML-Datei können mit HTML-Tags die Inhalte der Webseite strukturiert und neben Text auch andere Inhalte hinzugefügt werden. Mit ihnen kann beispielsweise markiert werden, welcher Text ein Paragraph und welcher eine Überschrift ist.</p><ccm-le-img src=../image/LE03_Inhalt.001.jpg></ccm-le-img><p>In diesem Video verwende ich den kostenfreien Online-Quelltext-Editor <a href=https://thimble.mozilla.org/de/ >Thimble</a>, der weder die Installation eines Programms, noch ein bestimmtes Betriebssystem voraussetzt und mir zu Änderungen in HTML direkt eine Vorschau der Webseite anzeigt.<h3>2.2 Syntax eines HTML-Tags</h3><p>Ein HTML-Tag beginnt im einfachsten Falle mit einer öffnenden spitzen Klammer, gefolgt von dem Namen des HTML-Tags und abschließend einer schließenden spitzen Klammer. Im Beispiel sieht man bereits, dass für die Markierung einer Überschrift ein &lt;h1>-Tag verwendet wird und für Paragraphen ein &lt;p>-Tag.<h3>2.3 Öffnende und schließende HTML-Tags</h3><p>Zu den meisten HTML-Tags gibt es eine öffnende und schließende Variante, wie man bereits am Beispiel von Überschrift und Paragraph erkennen kann. Bei der Überschrift wird dadurch beispielsweise markiert, wo die Überschrift anfängt und wo sie endet bzw. welcher Text genau später vom Webbrowser als Überschrift zu interpretieren ist.<p>Um beide Varianten zu unterscheiden, hat der schließende HTML-Tag zusätzlich, direkt nach der öffnenden spitzen Klammer, also als zweites Zeichen, einen Schrägstrich \"/\".<h3>2.4 Nicht-schließende HTML-Tags</h3><p>Es gibt aber auch wenige HTML-Tags, für die es keinen schließenden HTML-Tag gibt, sondern nur einen Öffnenden. Dies gilt z.B. für einen &lt;br>-Tag, der lediglich einen Zeilenumbruch angibt und für den ein schließender HTML-Tag daher wenig Sinn macht.</p><ccm-le-img src=../image/LE03_Inhalt.004.jpg></ccm-le-img><h3>2.5 Strukturierung des HTML-Codes</h3><p>Für den Webbrowser macht es übrigens keinen Unterschied, wie wir den HTML-Code strukturieren, er könnte genauso gut auch in einer einzigen langen Zeile stehen.</p><ccm-le-img src=../image/LE03_Inhalt.005.jpg></ccm-le-img><p>Damit der HTML-Code aber für das menschliche Auge möglichst gut lesbar ist, wird er üblicherweise, wie vorher gezeigt, mit Zeilenumbrüchen und Leerzeichen eingerückt. Überprüfen Sie am besten direkt immer selbst, wie der Webbrowser die Inhalte der Webseite nach einer Änderung des HTML-Codes darstellt, indem Sie Ihre Änderungen speichern und die HTML-Datei erneut mit dem Webbrowser öffnen bzw. dort neu laden. Beim Online-Quelltext-Editor Thimble genügt ein Klick auf \"Vorschau aktualisieren\".<h3>2.6 Überschriftenebenen</h3><p>Zum Markieren von Überschriften gibt es in HTML neben dem &lt;h1>-Tag noch die HTML-Tags &lt;h2>, &lt;h3>, &lt;h4>, &lt;h5> und &lt;h6>. Jeder dieser Tags steht für eine Überschriftenebene, von denen es somit insgesamt 6 Ebenen gibt. Der von uns bereits verwendete &lt;h1>-Tag steht für die oberste Überschriftenebene. Die Überschrift zu einem Kapitel würde man also beispielsweise mit einem &lt;h1>-Tag markieren und die der Unterkapitel mit einem &lt;h2>-Tag, usw..</p><ccm-le-img src=../image/LE03_Inhalt.006.jpg></ccm-le-img><p>Experimentieren Sie ruhig etwas mit diesen HTML-Tags und schauen Sie sich das Ergebnis im Webbrowser an.<h3>2.7 Kommentare</h3><p>In HTML gibt es die Möglichkeit an beliebigen Stellen im HTML-Code Kommentare zu hinterlegen. Alles was innerhalb eines Kommentars steht wird vom Webbrowser nicht angezeigt und ignoriert. Dies kann nützlich sein um individuelle Anmerkungen im Code zu hinterlegen oder bestimmte Code-Bereiche, die kurzzeitig nicht benötigt werden, gezielt \"auszukommentieren\". Das bedeutet diese Bereiche also nicht zu löschen, sondern sie nur ignorieren zu lassen, um sie später leicht jederzeit wiederherherstellen zu können.</p><ccm-le-img src=../image/LE03_Inhalt.007.jpg></ccm-le-img><h3>2.8 Syntax eines HTML-Kommentars</h3><p>Ein Kommentar beginnt immer mit einer öffnenden spitzen Klammer, gefolgt von einem Ausrufezeichen und zwei Trennstrichen (&lt;!--) und endet mit zwei Trennstrichen gefolgt von einer schließenden spitzen Klammer (-->).<p>Vor allem bei umfangreichen Webseiten sind Kommentare nützlich, um HTML-Code mit Anmerkungen anzureichern, die helfen sich in dem Quelltext schneller zurechtzufinden.<h2>3. Selbsttest</h2><h3>3.1 Quiz</h3><ccm-quiz key='[\"ccm.get\",\"../data/quiz.json\",\"le03\"]'></ccm-quiz><h3>3.2 Lückentext</h3><ccm-cloze key='[\"ccm.get\",\"../data/cloze.json\",\"le03\"]'></ccm-cloze><h2>4. Alternative Materialien</h2><h3>4.1 HTML/Regeln/Textauszeichnung | SELFHTML-Wiki</h3><p>Einführung in Elemente und Tags in HTML aus der Internet-Dokumentation <a href=https://de.wikipedia.org/wiki/SELFHTML>SELFHTML</a>.</p><ccm-le-link href=https://wiki.selfhtml.org/wiki/HTML/Regeln/Textauszeichnung#Elemente_und_Tags_in_HTML></ccm-le-link><h3>4.2 HTML-Grundkurs: Was ist ein HTML-Tag? | YouTube</h3><p>YouTube-Video aus einem HTML-Grundkurs zur Einführung in HTML-Tags.</p><ccm-le-link href=https://youtu.be/g9khWkRT74A></ccm-le-link>"
  }
}